[
  "I'm no organ donor but I'd be happy to give you my heart.", 
  "You Sexy, You Fine. I Really Wanna Make You Mine.",
  "Roses are red, violets are blue, lava is hot and so are you.",
  "I heard you're good in algebra, can you replace my X without asking Y",
  "You look familiar, didn't we take a class together? I could've sworn we had chemistry.",
  "No pickupline here, move along",
  "I know somebody who likes you but if I weren't so shy, I'd tell you who.",
  "If I had to rate you out of 10 I'd rate you a 9 because I am the one that you are missing!",
  "Did you die recently? Cause girl, you look like an angel to me.",
  "Are you French because Eiffel for you",
  "Are you a time traveler? Cause I see you in my future!",
  "Roses are red violets are blue I didn't know what perfect was until I met you.",
  "I used to be a Gambler, but then I realised that all I needed was the Queen of my Heart.",
  "You may fall from the sky, you may fall from a tree, but the best way to fall is in love with me.",
  "Of all your beautiful curves, your smile is my favourite.",
  "Guess what I'm wearing? The smile you gave me!",
  "There isn't a word in the dictionary to describe how beautiful you are.",
  "My friends bet I can't talk to the prettiest girl. Wanna use their money to buy drinks?",
  "You know what's beautiful? Read the first word.",
  "If I had 4 quarters to give to the 4 prettiest girls in the world, you would have a dollar.",
  "I'd never play hide and seek with you because someone like you is impossible to find.",
  "I hope you know CPR, because you just took my breath away!",
  "So, aside from taking my breath away, what do you do for a living?",
  "I ought to complain to Spotify for you not being named this week's hottest single.",
  "Are you a parking ticket? 'Cause you’ve got \"fine\" written all over you.",
  "Your eyes are like the ocean; I could swim in them all day.",
  "When I look in your eyes, I see a very kind soul.",
  "Roses are red, I have a crush, whenever I'm around you, all I do is blush.",
  "If you were a vegetable, you'd be a \"cute-cumber.\"",
  "I may not be good at dancing but i can tangle with with you all night long.",
  "Do you happen to have a Band-Aid? ‘Cause I scraped my knees falling for you.",
  "You're so hot I don't even have to alter the data to prove it.",
  "You look charming! Of course, there could be methodology or sampling errors in my seasonally-adjusted data.",
  "Hey baby, did you fall from heaven? Because I have no tracking data to indicate how you arrived at this location.",
  "My satellite data is much cooler than your bloated, manipulated surface record.",
  "Are you a computer? Because I’d like to put my usb stick in your slot and transfer my data.",
  "If I did anything right in my life, it was when I gave my heart to you, my special one.",
  "Are you Google? Because you have everything I'm searching for.",
  "My love for you is uncountable.",
  "I don't know about my future, but when I look into your eyes, then I know my future is you.",
  "If love was a storybook, we'd meet on the very first page.",
  "My love’s like salt sea is not visible, but always the love and affection forever.",
  "Without a word, you let me know about love. Without a word, you give me cherish.",
  "I saw the best and worst in you and i'm willing to stay.",
  "Every night I think of you before bed with the hopes of having you in my dreams.",
  "Love is when you look into someones eyes and see everything you need.",
  "I'm not perfect, I know that. I make mistakes, I know I do. And I do know that I will always love you",
  "I Love that feeling I get when I see your smile.",
  "I feel so lucky to have you.",
  "I love you like a kid loves cake!",
  "Touch her heart not her body. Make her smile don't waste her tears.",
  "If I could reach up and hold a star for every time you’ve made me smile, the entire evening sky would be in the palm of my hand.",
  "I hope you always fins a reason to smile and I hope I can always be the reason.",
  "Loving you made me feel complete.",
  "Fall in love with someone who deserve your heart. Not someone who plays with it.",
  "You do not be afraid of the dark. Because i always shine upon you.",
  "You may not be a painter, but you've painted my life colorful with your smile.",
  "Are you religious? Because you're the answer to all my prayers.",
  "So, aside from taking my breath away, what do you do for living?",
  "Is your name Wifi? Because I'm feeling a connection",
  "I'm bad in Chemistry but I can tell what's the reaction when you smile at me.",
  "I'm bad in Physics but I can tell the intensity of spark of my eyes when they see you.",
  "I think I'm butterfly, because I always fly in your heart.",
  "I'm bad in History but I can remember when I first saw you.",
  "Is ur father working at Jewelry? Because ur face shine like a diamond.",
  "Do you know butterfly? If you know you are the beautiful butterfly in the world.",
  "There are 3 sun in this world. 1 up there, and 2 in your eyes.",
  "I could be the blossom, and you could be the bee, and then I could call you honey.",
  "I've lost my phone number. Can I have yours?",
  "I'm feeling glad now because of you always dance in my heart.",
  "I wish I had a great drawing skill, so I could draw stars on your eyes.",
  "Do you know sugar? It is you, because you're so sweet.",
  "I feel like flying in the sky when you look at me. I hope the wind will tell you how much I love you.",
  "If I were an octopus, all my hearts would belong to you.",
  "If I were a cat, I'd spend all seven of my loves with you.",
  "I wish were cross-eyed, so I can see you twice.",
  "I must be a snowflake because I've fallen for you.",
  "You know, I always thought that disneyland was the 'happiest place on earth,' but that was before I got a chance to stand here next to you.",
  "Are you a magician? It's the strangest thing, but every time I look at you, everyone else disappears.",
  "You've got a lot of beautiful curves, but your smiles is absolutely my favorite.",
  "I always thought happiness started with an 'H', but it turns out mine starts with you.",
  "I didn't know what I wanted in a woman until I saw you.",
  "If I had a star for every time you brightened my day, I'd have a galaxy in my hand.",
  "Do you have a pencil? Cause I want to erase your past and write our future.",
  "If being sexy was a crime, you'd be guilty as charged.",
  "Guess I'm wearing? The smile you gave me.",
  "In my opinion, there are three kinds of beautiful: cute, pretty, and sexy. Somehow, you manage to be all three.",
  "The sparkle in your eyes is so bright, the sun must be jealous.",
  "Your eyes are like the ocean, I could swim in them all day.",
  "You wanna know what's beautiful? Read the first word again.",
  "Me without you is like a nerd without braces, a shoe without laces, and a sentence without spaces.",
  "You're kinda sorta basically, pretty much always on my mind.",
  "Did you invent the airplane? Cause you seem wright for me.",
  "Wouldn't we look cute on a wedding cake together?",
  "Please keep your distance, I might fall for you.",
  "If you were a vegetable you'd be a cutecumber.",
  "If you were a fruit, you'd be a fine-apple.",
  "Did you just come out of the oven? Because you're hot.",
  "You can't spell virus without U and I.",
  "I thought happines started with a H, so why does mine start with U?",
  "Can I get you a drink? You must be tired after running around my head all day."
]