[
  "I'm no organ donor but I'd be happy to give you my heart.",
  "You Sexy, You Fine. I Really Wanna Make You Mine.",
  "Roses are red, violets are blue, lava is hot and so are you.",
  "I heard you're good in algebra, can you replace my X without asking Y",
  "You look familiar, didn't we take a class together? I could've sworn we had chemistry.",
  "No pickupline here, move along",
  "I know somebody who likes you but if I weren't so shy, I'd tell you who.",
  "If I had to rate you out of 10 I'd rate you a 9 because I am the one that you are missing!",
  "Did you die recently? Cause girl, you look like an angel to me.",
  "Are you French because Eiffel for you",
  "Are you a time traveler? Cause I see you in my future!",
  "Roses are red violets are blue I didn't know what perfect was until I met you.",
  "I used to be a Gambler, but then I realised that all I needed was the Queen of my Heart.",
  "You may fall from the sky, you may fall from a tree, but the best way to fall is in love with me.",
  "Of all your beautiful curves, your smile is my favourite.",
  "Guess what I'm wearing? The smile you gave me!",
  "There isn't a word in the dictionary to describe how beautiful you are.",
  "My friends bet I can't talk to the prettiest girl. Wanna use their money to buy drinks?",
  "You know what's beautiful? Read the first word.",
  "If I had 4 quarters to give to the 4 prettiest girls in the world, you would have a dollar.",
  "I'd never play hide and seek with you because someone like you is impossible to find.",
  "I hope you know CPR, because you just took my breath away!",
  "So, aside from taking my breath away, what do you do for a living?",
  "I ought to complain to Spotify for you not being named this week's hottest single.",
  "Are you a parking ticket? 'Cause you’ve got \"fine\" written all over you.",
  "Your eyes are like the ocean; I could swim in them all day.",
  "When I look in your eyes, I see a very kind soul.",
  "Roses are red, I have a crush, whenever I'm around you, all I do is blush.",
  "If you were a vegetable, you'd be a \"cute-cumber.\"",
  "I may not be good at dancing but i can tangle with with you all night long.",
  "Do you happen to have a Band-Aid? ‘Cause I scraped my knees falling for you.",
  "You're so hot I don't even have to alter the data to prove it.",
  "You look charming! Of course, there could be methodology or sampling errors in my seasonally-adjusted data.",
  "Hey baby, did you fall from heaven? Because I have no tracking data to indicate how you arrived at this location.",
  "My satellite data is much cooler than your bloated, manipulated surface record.",
  "Are you a computer? Because I’d like to put my usb stick in your slot and transfer my data.",
  "If I did anything right in my life, it was when I gave my heart to you, my special one.",
  "Are you Google? Because you have everything I'm searching for.",
  "My love for you is uncountable.",
  "I don't know about my future, but when I look into your eyes, then I know my future is you.",
  "If love was a storybook, we'd meet on the very first page.",
  "My love’s like salt sea is not visible, but always the love and affection forever.",
  "Without a word, you let me know about love. Without a word, you give me cherish.",
  "I saw the best and worst in you and i'm willing to stay.",
  "Every night I think of you before bed with the hopes of having you in my dreams.",
  "Love is when you look into someones eyes and see everything you need.",
  "I'm not perfect, I know that. I make mistakes, I know I do. And I do know that I will always love you",
  "I Love that feeling I get when I see your smile.",
  "I feel so lucky to have you.",
  "I love you like a kid loves cake!",
  "Touch her heart not her body. Make her smile don't waste her tears.",
  "If I could reach up and hold a star for every time you’ve made me smile, the entire evening sky would be in the palm of my hand.",
  "I hope you always fins a reason to smile and I hope I can always be the reason.",
  "Loving you made me feel complete.",
  "Fall in love with someone who deserve your heart. Not someone who plays with it.",
  "You do not be afraid of the dark. Because i always shine upon you.",
  "You may not be a painter, but you've painted my life colorful with your smile.",
  "Are you religious? Because you're the answer to all my prayers.",
  "So, aside from taking my breath away, what do you do for living?",
  "Is your name Wifi? Because I'm feeling a connection",
  "I'm bad in Chemistry but I can tell what's the reaction when you smile at me.",
  "I'm bad in Physics but I can tell the intensity of spark of my eyes when they see you.",
  "I think I'm butterfly, because I always fly in your heart.",
  "I'm bad in History but I can remember when I first saw you.",
  "Is ur father working at Jewelry? Because ur face shine like a diamond.",
  "Do you know butterfly? If you know you are the beautiful butterfly in the world.",
  "There are 3 sun in this world. 1 up there, and 2 in your eyes.",
  "I could be the blossom, and you could be the bee, and then I could call you honey.",
  "I've lost my phone number. Can I have yours?",
  "I'm feeling glad now because of you always dance in my heart.",
  "I wish I had a great drawing skill, so I could draw stars on your eyes.",
  "Do you know sugar? It is you, because you're so sweet.",
  "I feel like flying in the sky when you look at me. I hope the wind will tell you how much I love you.",
  "If I were an octopus, all my hearts would belong to you.",
  "If I were a cat, I'd spend all seven of my loves with you.",
  "I wish were cross-eyed, so I can see you twice.",
  "I must be a snowflake because I've fallen for you.",
  "You know, I always thought that disneyland was the 'happiest place on earth,' but that was before I got a chance to stand here next to you.",
  "Are you a magician? It's the strangest thing, but every time I look at you, everyone else disappears.",
  "You've got a lot of beautiful curves, but your smiles is absolutely my favorite.",
  "I always thought happiness started with an 'H', but it turns out mine starts with you.",
  "I didn't know what I wanted in a woman until I saw you.",
  "If I had a star for every time you brightened my day, I'd have a galaxy in my hand.",
  "Do you have a pencil? Cause I want to erase your past and write our future.",
  "If being sexy was a crime, you'd be guilty as charged.",
  "Guess I'm wearing? The smile you gave me.",
  "In my opinion, there are three kinds of beautiful: cute, pretty, and sexy. Somehow, you manage to be all three.",
  "The sparkle in your eyes is so bright, the sun must be jealous.",
  "Your eyes are like the ocean, I could swim in them all day.",
  "You wanna know what's beautiful? Read the first word again.",
  "Me without you is like a nerd without braces, a shoe without laces, and a sentence without spaces.",
  "You're kinda sorta basically, pretty much always on my mind.",
  "Did you invent the airplane? Cause you seem wright for me.",
  "Wouldn't we look cute on a wedding cake together?",
  "Please keep your distance, I might fall for you.",
  "If you were a vegetable you'd be a cutecumber.",
  "If you were a fruit, you'd be a fine-apple.",
  "Did you just come out of the oven? Because you're hot.",
  "You can't spell virus without U and I.",
  "I thought happines started with a H, so why does mine start with U?",
  "Can I get you a drink? You must be tired after running around my head all day.",
  "Are you a Skip Ad button? Because I can't wait toi smash you real hard.",
  "Do you have a pencil? Cause I want to erase your past and write our future.",
  "You’re so beautiful that you made me forget my pickup line",
  "Are you from the Netherlands? Cause Amster-DAMN you look fine!",
  "My love for you is like diarrhea, I just can't hold it in.",
  "They say the tongue is the strongest muscle. Wanna wrestly?",
  "Your kids will be cute, but the Y is silent.",
  "I'm glad I remembered to bring my library card. 'Cause I am totally checking you out!",
  "You must be a broom, ‘cause you just swept me off my feet.",
  "Are you the morning bus? 'Cause I always miss you.",
  "Are you a President? Because, you just Barack'ed my world.",
  "Are you an elevator? Because I’ll go up and down on you.",
  "I'm no photographer, but I can picture us together.",
  "Damn, I'm no weather man, but you can expect a couple inches tonight.",
  "Kiss me if I'm wrong. But dinosaurs still exist, right?",
  "Baby, if you were words on a page, you'd be fine print.",
  "Mario is red, Sonic is blue, will you be my player 2.",
  "Are you a Chinese factory? Cause I wanna put some kids in you!",
  "I was blinded by your beauty; I’m going to need your name and phone number for insurance purpose",
  "You are so hot, that the temperature itself broke the ice.",
  "My mom told me that life was a deck of cards, so I guess you must be the queen of hearts.",
  "Are you a loan? Cause you've got my interest!",
  "You must be a high test score. Because I want to take you home and show you to my mother.",
  "I'm not drunk, I'm just intoxicated by YOU.",
  "Your parents must be drug dealers. Because, I'm addicted to what they made.",
  "Are you a cook, because you would really spice up my life.",
  "You must be made of cheese. Because you're looking Gouda tonight!",
  "Are you the ∑(1/n^2) from 1 to ∞? Because my heart converges absolutely to you",
  "Do you like Minecraft? Because I want to make your bedrock.",
  "I wasn't always religious. But I am now, because you're the answer to all my prayers.",
  "Is your dad a terrorist? Cause you’re the bomb.",
  "Ouch! My tooth aches. Cuz you're so sweet.",
  "I love you with all my cicle, not my heart. Because, hearts break, but a circle goes on forever.",
  "They say Disneyland is the happiest place on earth. Well apparently, no one has ever been standing next to you.",
  "Are you religious? Because you’re the answer to all my prayers.",
  "Did your licence get suspended for driving all these guys crazy?",
  "Do you have a name? Or can I call you mine.",
  "If I could rearrange the alphabet, I would put U and I together.",
  "Are you a cat because I’m feline a connection between us.",
  "Are you a Pokemon? Cause I wanna peekatchu",
  "Why would I need to know about the solar system? My whole world revolves around you.",
  "Do you like Star Wars? Because Yoda only one for me!",
  "Was your dad a boxer? Because damn, you’re a knockout!",
  "One a scale of 1 to 10, you are an 8. And I'm in 2 you.",
  "Is this the Hogwarts Express? Because it feels like you and I are headed somewhere magical.",
  "Do you want to go to In-and-Out for burgers or just in-and-out of me?",
  "There are 7.8 billion smiles on Earth. And, I'm still waiting for yours.",
  "Do you know CPR? Because you are taking my breath away!",
  "Are you a cat? Cause you are purrrfect",
  "They say that kissing is a language of love, so would you mind starting a conversation with me?",
  "Hi, how was heaven when you left it?",
  "You look familar, did we take a class together? We must've had chemistry.",
  "Was that an earthquake, or did you just rock my world.",
  "Did you invent the airplane? Because you seem Wright for me.",
  "We’re not socks, but I think we’d make a great pair.",
  "Are you Jewish? Cause you ISRAELI HOT.",
  "I heard you're good in Algebra. Can you replace my X without asking Y.",
  "Do you like yoga? Cause yoga'na love me.",
  "You must be a campfire. Because you're super hot and I want s'more.",
  "Can I take a picture of you real quick? I gotta show Santa what I want for Chirstmas.",
  "I'd like to do Astronomy, but instead of looking at the heavens I'd like to look at you.",
  "I seem to have lost my phone number. Can I have yours?",
  "Most guys would want to watch the world cup because it happens once in 4 years... But, I'd rather look at you because the chances of meeting someone like you is once in a lifetime.",
  "What did the guy say to the girl before they started dating? \"What did the guy say to the girl before they started dating\".",
  "Do you have a map? I keep getting lost in your eyes.",
  "Hey, my name's Microsft. Can I crash at your place tonight?",
  "You're so sweet, you'd put Hershey's out of business!",
  "Aside from being sexy, what do you do for a living?",
  "Roses are red, I want you to remember. You are the reason, I lost no nut November.",
  "If I had a dollar for every time I think of you, I would have a dollar. Because you never leave my mind.",
  "Do you mind if I walk you home? My mother always told me to follow my dreams.",
  "Feel my shirt. Know what it’s made of? Boyfriend material.",
  "Can you lend me some kisses and hugs? I'll return them with 100% interest.",
  "There’s only one thing I want to change about you, and that’s your last name.",
  "Screw the alphabet, cause U R A Q T.",
  "If you were a flower you’d be a damnnn-delion.",
  "Just took a DNA test. Turns out I'm 100% your type.",
  "I'm in the mood for pizza. A pizza you, that is.",
  "Are you my phone charger? Because without you, I’d die.",
  "I’m lost. Can you give me directions to your heart?",
  "Are you lost ma’am? Because heaven is a long way from here.",
  "Is there an airport nearby or is it my heart taking off?",
  "Call me country roads, cause I'mma take you home.",
  "Are you a Pokemon? Because I want to hit you with my balls.",
  "Are you the Russian Revolution? Because there's an uprising in my lower class.",
  "Do you smoke pot? Because weed be cute together.",
  "If I asked you out on a date, would your answer be the same as your answer to this one?",
  "Not really into sunsets, but I would love to see you go down.",
  "Can I follow you where you’re going right now? Because my parents always told me to follow my dreams.",
  "Do you have 11 protons? Becuse, you are sodium fine.",
  "Boy, I wanna go swimming but I'm already drowing in your eyes",
  "Did you know kissing burns 6 calories. Let's go work out :).",
  "Did the sun come out or did you just smile at me?",
  "Are you a dictionary? Cause you're adding meaning to my life.",
  "Hey girl, are you made of caffeine? Because you are the reason I can't sleep at night."
]